In [1]:
# Как различается среднее и дисперсия оценок по предметам у групп студентов со стандартным или урезанным ланчем?

import pandas as pd

students = pd.read_csv("C:\\Users\\ump\\Dropbox\\ПК\\Documents\\DataScience\\students.csv")
students

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [20]:
standard = students.loc[students.lunch == "standard", ["lunch", "math score", "reading score"]]
free = students.loc[students.lunch  == "free/reduced", ["lunch", "math score", "reading score"]]

standard.mean()

math score       70.034109
reading score    71.654264
dtype: float64

In [21]:
free.mean()

math score       58.921127
reading score    64.653521
dtype: float64

In [23]:
standard.var()

math score       186.418089
reading score    191.285560
dtype: float64

In [24]:
free.var()

math score       229.824270
reading score    221.871139
dtype: float64

In [50]:
students.groupby('lunch').aggregate({'math score':['mean', 'std'], 'reading score':['mean', 'std'], 'writing score':['mean', 'std']})

             math score            reading score            writing score  \
                   mean        std          mean        std          mean
lunch
free/reduced  58.921127  15.159956     64.653521  14.895339     63.022535
standard      70.034109  13.653501     71.654264  13.830602     70.823256


                    std
lunch
free/reduced  15.433823
standard      14.339487

In [51]:
# У какой доли студентов из датасэта в колонке lunch указано free/reduced?

students

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [61]:
students["lunch"].value_counts(normalize=True)

standard        0.645
free/reduced    0.355
Name: lunch, dtype: float64

In [71]:
hell = pd.read_csv("C:\\Users\\ump\\Dropbox\\ПК\\Documents\\DataScience\\column_hell.csv")
selected_columns = hell.filter(like = '-')
selected_columns.shape

(100, 6)

In [72]:
hell.shape

(100, 75)

TypeError: type tuple doesn't define __round__ method